{"_id":{"$oid":"6670857b272301fa8090defe"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featuered":true}
{"_id":{"$oid":"6671bc7a86ab0f463590defe"},"Title":"Inception","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a CEO.","Genre":{"Name":"Sci-Fi","Description":"Science fiction is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Christopher Nolan","Bio":"Sir Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, he is considered a leading filmmaker of the 21st century. Nolan's films have earned over $6 billion worldwide, making him the seventh-highest-grossing film director of all time.","Birth":"1970","Death":null},"ImagePath":"inception.png","Featured":true}
{"_id":{"$oid":"6671c003a3dc10fc5890defe"},"Title":"The Shawshank Redemption","Description":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","Genre":{"Name":"Drama","Description":"Films that are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Frank Darabont","Bio":"Frank Árpád Darabont is an American screenwriter, director and producer. He has been nominated for three Academy Awards and a Golden Globe Award. In his early career, he was primarily a screenwriter for such horror films as A Nightmare on Elm Street 3: Dream Warriors, The Blob and The Fly II.","Birth":"1959","Death":null},"ImagePath":"shawshankredemption.png","Featured":true}
{"_id":{"$oid":"6671c262a3dc10fc5890deff"},"Title":"The Dark Knight","Description":"The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos.","Genre":{"Name":"Action","Description":"Action is a film genre that predominantly features chase sequences, fights, shootouts, explosions, and stunt work."},"Director":{"Name":"Christopher Nolan","Bio":"Sir Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, he is considered a leading filmmaker of the 21st century. Nolan's films have earned over $6 billion worldwide, making him the seventh-highest-grossing film director of all time.","Birth":"1970","Death":null},"ImagePath":"darkkight.png","Featured":true}
{"_id":{"$oid":"6671c4b7a3dc10fc5890df00"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster, and his wife intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film, but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, and actor. His films are characterized by stylized violence, extended dialogue often with profanity, and references to popular culture.","Birth":"1963","Death":null},"ImagePath":"pulpfiction.png","Featured":true}
{"_id":{"$oid":"6671c7e3a3dc10fc5890df01"},"Title":"Forest Gump","Description":"The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal, and other historical events unfold from the perspective of an Alabama man with an IQ of 75.","Genre":{"Name":"Drama","Description":"Films that are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of the action-adventure romantic comedy Romancing the Stone, the science-fiction comedy Back to the Future trilogy, and the live-action/animated comedy Who Framed Roger Rabbit.","Birth":"1952","Death":null},"ImagePath":"forestgump.png","Featured":true}
{"_id":{"$oid":"6671cb07a3dc10fc5890df02"},"Title":"The Matrix","Description":"When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.","Genre":{"Name":"Sci-Fi","Description":"Science fiction is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Lana Wachowski, Lilly Wachowski","Bio":"Together known as the Wachowskis the sisters have worked as a writing and directing team through most of their careers. They made their directing debut in 1996 with Bound and achieved fame with their second film, The Matrix (1999), a major box-office success for which they won the Saturn Award for Best Director.","Birth":"1965, 1967","Death":null},"ImagePath":"thematrix.png","Featured":true}
{"_id":{"$oid":"6671cd1d11ecb9fd4890defe"},"Title":"Lord of the Rings: The Fellowship of the Ring","Description":"A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkien.","Birth":"1961","Death":null},"ImagePath":"lotr.png","Featured":true}
{"_id":{"$oid":"6671d0c411ecb9fd4890deff"},"Title":"Star Wars: Episode IV - A New Hope","Description":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee, and two droids to save the galaxy from the Empire.","Genre":{"Name":"Sci-Fi","Description":"Science fiction is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"George Lucas","Bio":"George Walton Lucas Jr. is an American filmmaker and philanthropist. He created the Star Wars and Indiana Jones franchises and founded Lucasfilm, LucasArts, Industrial Light & Magic and THX. He served as chairman of Lucasfilm before selling it to The Walt Disney Company in 2012.","Birth":"1944","Death":null},"ImagePath":"starwarsepisodeIV.png","Featured":true}
{"_id":{"$oid":"6671d2e911ecb9fd4890df00"},"Title":"Fight Club","Description":"An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.","Genre":{"Name":"Drama","Description":"Films that are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American film director. His films, most of which are psychological thrillers, have collectively grossed over $2.1 billion worldwide and have received numerous accolades, including three nominations for the Academy Awards for Best Director.","Birth":"1962","Death":null},"ImagePath":"fightclub.png","Featured":true}
